{
  "gpgPublicKey": "-----BEGIN PGP PUBLIC KEY BLOCK-----\n\nmDMEZaXVAxYJKwYBBAHaRw8BAQdAyhDlhXA5hnL4V2y6Q4vJEkucMGpRQrJ/p5UD\nMAE6Sce0KEx1aXMgUXVpw7FvbmVzIDxscGFhbmRyZXMyMDIwQGdtYWlsLmNvbT6I\nmQQTFgoAQRYhBDxTz6cvfQw2fEasiNb8kv06CUr4BQJlpdUDAhsDBQkB4TOABQsJ\nCAcCAiICBhUKCQgLAgQWAgMBAh4HAheAAAoJENb8kv06CUr4mMUA+wQH1VxQKn5t\nNCOo7chYneRzDaD2GzF1tRIpUu16AGL/AQCeyfBh81UPHBchVHYq7pRJ+kqS1rUT\nDzinBCMp94p7BLg4BGWl1QMSCisGAQQBl1UBBQEBB0CQLkervjt4XBi9Qwo1w5yF\npss7i9KGKuHrr6En7HQqHAMBCAeIfgQYFgoAJhYhBDxTz6cvfQw2fEasiNb8kv06\nCUr4BQJlpdUDAhsMBQkB4TOAAAoJENb8kv06CUr4O6sBAK/c5cq8/xT5lRJlgfmr\nPp1ZxNf0eGvLUXqMdKNfXgJxAP0Zq+MkjmR6Tce8BkJj0eG4IbdHtx/WyFghbfGh\n4ZDeDg==\n=6RF7\n-----END PGP PUBLIC KEY BLOCK-----",
  "contactEmail": "lpaandres2020@gmail.com",
  "lastCLIUpdate": "Apr 13, 2023",
  "externalLinks": [
    {
      "name": "Github",
      "url": "https://github.com/luisnquin"
    },
    {
      "name": "GitLab",
      "url": "https://gitlab.com/luisnquin"
    },
    {
      "name": "LinkedIn",
      "url": "https://linkedin.com/in/luisnquin"
    },
    {
      "name": "Resume",
      "url": "https://luisnquin-2.s3.us-east-2.amazonaws.com/luis-quinones-resume.pdf"
    }
  ],
  "reviews": [
    {
      "author": "Romain Dutartre",
      "position": "Senior Lead Developer",
      "content": "I've had the pleasure of working with Luis for a long time and he was a very passionate worker, always trying to improve and taking a step further in all aspects of his work. I know that he'll be able to integrate whatever team will be lucky enough to have him."
    },
    {
      "author": "William Matteini",
      "position": "Project Manager",
      "content": "I highly recommend Luis. He is a person who learns quickly and is reliable. He has proven to be a key element in my team."
    },
    {
      "propaganda": true
    }
  ],
  "companyExperiences": [
    {
      "companyName": "Inversiones.io",
      "experiences": [
        {
          "positionTitle": "Software Developer",
          "location": {
            "place": "Lima, Peru",
            "type": "On-site"
          },
          "technologies": ["nestjs", "mysql", "nodejs"],
          "startDate": "2024-01-01",
          "endDate": null
        }
      ]
    },
    {
      "companyName": "WiserSKILLS",
      "about": "Is a widely used product by human resources to make career enhancements for the employees within their organizations. This tool empowers collaborators to refine and augment their skills based on their current job roles, aspirations and motivations.\nI played a crucial role as a team member in this project, contributing to frontend, backend and production deployments while adhering to Agile and DevOps methodologies.",
      "experiences": [
        {
          "positionTitle": "Software Developer",
          "location": {
            "place": "Paris, France",
            "type": "Remote"
          },
          "technologies": [
            "go",
            "arangodb",
            "docker",
            "kubernetes",
            "aws",
            "python",
            "linux",
            "typescript",
            "vuejs",
            "argocd",
            "nodejs"
          ],
          "desc": {
            "achievements": [
              "Improvements in the software reliability redifining and improving critical services with E2E, integration and unit tests.",
              "Migration of services from WebSocket to a REST architecture, achieving that all the platform becomes more scalable.",
              "Better response time in key features of the company's main products (with x58 times the most notable improvement in response time).",
              "Configuration, deployment and monitoring of QA, UAT and PROD environments(more than 30 applications)."
            ]
          },
          "startDate": "2023-06-01",
          "endDate": "2023-12-01"
        },
        {
          "positionTitle": "Backend Developer",
          "location": {
            "place": "Paris, France",
            "type": "Remote"
          },
          "technologies": [
            "go",
            "arangodb",
            "vuejs",
            "aws",
            "docker",
            "linux",
            "typescript"
          ],
          "desc": {
            "achievements": [
              "Improved the development experience making that the productivity increases by 92.5% in all the cases.",
              "Configuration, deploying and monitoring tasks of more than 20 deployed servers using ArgoCD, kubernetes and k9s.",
              "I dealt with multiple cases of race condition issues that have been in the backend before my entry.",
              "Automation of some common processes for the backend and the DevOps team."
            ]
          },
          "startDate": "2022-02-01",
          "endDate": "2023-06-01"
        }
      ]
    },
    {
      "companyName": "Desstorm",
      "experiences": [
        {
          "location": {
            "place": "Peru",
            "type": "Remote"
          },
          "positionTitle": "Web Developer",
          "technologies": ["javascript", "firebase", "css"],
          "startDate": "2021-10-01",
          "endDate": "2021-12-01"
        }
      ]
    }
  ],
  "projects": [
    {
      "title": "luisnquin/nixos-config",
      "desc": "Configurations for my NixOS computer that I've maintained since 2022",
      "why": "I've been experimenting with all kind of setups on other Linux distros like Ubuntu, Debian, PopOS, Kali, etc. I broke my setup too many times and spent a lot of time rebuilding my computer with the necessary work tools and personal settings... NixOS was there as a solution with its reproducibility and ability to roll back to \"x\" generation that I wanted to use. I loved it so much that it has been my main operating system since then.",
      "repositoryUrl": "https://github.com/luisnquin/nixos-config"
    },
    {
      "title": "luisnquin/senv",
      "desc": "CLI to switch between .env files that could be easily coupled with other tools",
      "why": "As I highlighted in my experience, I was in charge of the QA, UAT and PROD environments of my last company. To that, add the fact that I also have a development(local) environment and multiple projects for backend, frontend, and other operations. I found other dotenv switchers, but no simple CLIs and nothing with the same taste and coupling that I could have with this project while moving around in the terminal.",
      "repositoryUrl": "https://github.com/luisnquin/senv"
    },
    {
      "title": "luisnquin/nao",
      "desc": "CLI tool to take notes with usage based on coreutils commands",
      "why": "There are many CLI programs that try to cover the area of \"note taking\", most of them were complex to learn, meaning you have to learn another CLI. I wanted something with subcommands that would be familiar to me, that could be integrated with other programs via pipe taking advantage of the possible output formats that the user could indicate and overall something that would make the user completely forget concept of filesystem while searching for their notes. As a solution for the last point I was very inspired by how images can be managed with the Docker CLI.",
      "repositoryUrl": "https://github.com/luisnquin/nao"
    },
    {
      "title": "luisnquin/battery-notifier",
      "desc": "Customizable daemon that reports the battery status of the guest laptop",
      "why": "I prefer tiling window managers over standard desktop environments because they offer greater customization. As I write this, I'm using Hyprland, a window manager that does not include a built-in battery notifier. Due to the limited options available for user customization, particularly those that prioritize performance, I have developed this program to address this gap.",
      "repositoryUrl": "https://github.com/luisnquin/battery-notifier"
    }
  ],
  "technologies": [
    {
      "name": "Programming Languages",
      "desc": " Go,  Python, 󰛦 TypeScript,  OCaml and  Rust",
      "iconPath": "/programming-languages.png"
    },
    {
      "name": "Deployment tools",
      "desc": "󰡨 Docker, 󱃾 Kubernetes, ArgoCD, etc",
      "iconPath": "/ci-cd-containerization-tools.png"
    },
    {
      "name": "Frontend tools",
      "desc": " React.js, Next.js and 󰡄 Vue.js",
      "iconPath": "/frontend-tools.png"
    },
    {
      "name": "Nix && NixOS",
      "desc": "󱄅 A reproducible, declarative and reliable package manager and operative system",
      "iconPath": "/nix-nixos.png"
    },
    {
      "name": "Cloud Computing",
      "desc": " AWS and 󱇶 Google Cloud Providers",
      "iconPath": "/cloud-providers.png"
    }
  ],
  "interests": [
    {
      "name": "Biomedical Enginnering",
      "desc": "Fascinated by the intersection of technology and healthcare, I am drawn to the impactful realm of Biomedical Engineering. This field, which leverages software development to enhance modern medicine, has already made significant contributions. I am excited about the potential it holds for the future and aspire to contribute my skills towards advancements in healthcare technology.",
      "externalLink": "https://en.wikipedia.org/wiki/Biomedical_engineering"
    },
    {
      "name": "Functional Programming",
      "desc": "While I don't impose this paradigm on others, I find beauty in the elegance and composability it offers when creating robust and maintainable software.",
      "externalLink": "https://en.wikipedia.org/wiki/Functional_programming"
    },
    {
      "name": "Nix ecosystem",
      "desc": "The reliable and reproducible package manager and operative system.",
      "externalLink": "https://nixos.org/"
    }
  ]
}
